app/controllers/payments_controller.rb

  def index
    @payments = Payment.all
---
SELECT "payments".* FROM "payments"