app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("product_name", "category", "unit_price", "selling_price", "vat", "date", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)