app/controllers/purchase_orders_controller.rb

  def index
    @purchase_orders = PurchaseOrder.all
---
SELECT "purchase_orders".* FROM "purchase_orders"